Repository: PaulStSmith/DeviantArtScrapper
Catalog: DeviantArtScrapper/Properties/Resources.*.resx
Languages: pt_br

# MainForm_StatusReady
source: Status: Ready - API configured and authenticated
pt_br: Status: Pronto - API configurada e autenticada

# MainForm_StatusConfigured
source: Status: Configured - Authentication required
pt_br: Status: Configurado - Autenticação necessária

# MainForm_StatusNotConfigured
source: Status: Not configured - Please configure API settings
pt_br: Status: Não configurado - Por favor, configure as definições da API

# Tab_Gallery
source: Gallery
pt_br: Galeria

# Tab_Favorites
source: Favorites
pt_br: Favoritos

# Label_Username
source: DeviantArt Username:
pt_br: Nome de usuário do DeviantArt:

# Label_FileName
source: File Name:
pt_br: Nome do arquivo:

# Label_FileFormat
source: File Format
pt_br: Formato do Arquivo

# Button_Browse
source: Browse...
pt_br: Procurar...

# Button_StartScraping
source: Start Scraping
pt_br: Iniciar Extração

# Button_Cancel
source: Cancel
pt_br: Cancelar

# Button_Settings
source: Settings
pt_br: Configurações

# Button_Save
source: Save
pt_br: Salvar

# Button_TestConnection
source: Test Connection
pt_br: Testar Conexão

# Progress_Initializing
source: Initializing...
pt_br: Inicializando...

# Progress_Collected
source: Collected {0} items...
pt_br: Coletados {0} itens...

# Progress_CollectedFavorites
source: Collected {0} favorites...
pt_br: Coletados {0} favoritos...

# Progress_Exporting
source: Exporting data...
pt_br: Exportando dados...

# Progress_Cancelling
source: Cancelling...
pt_br: Cancelando...

# Progress_ExportComplete
source: Export complete!
pt_br: Exportação concluída!

# Progress_Error
source: Error occurred
pt_br: Ocorreu um erro

# Progress_Scraping
source: Scraping...
pt_br: Extraindo...

# Progress_Complete
source: Complete
pt_br: Concluído

# Progress_RequestFailed
source: Request failed (attempt {0}/{1}), retrying in {2}ms...
pt_br: Solicitação falhou (tentativa {0}/{1}), tentando novamente em {2}ms...

# MessageBox_Information
source: Information
pt_br: Informação

# MessageBox_ValidationError
source: Validation Error
pt_br: Erro de Validação

# MessageBox_ConfigRequired
source: Configuration Required
pt_br: Configuração Necessária

# MessageBox_NoResults
source: No Results
pt_br: Nenhum Resultado

# MessageBox_ExportComplete
source: Export Complete
pt_br: Exportação Concluída

# MessageBox_Error
source: Error
pt_br: Erro

# MessageBox_Success
source: Success
pt_br: Sucesso

# MessageBox_Cancelled
source: Cancelled
pt_br: Cancelado

# MessageBox_PartialExport
source: Export Partial Results?
pt_br: Exportar Resultados Parciais?

# MessageBox_PartialComplete
source: Partial Export Complete
pt_br: Exportação Parcial Concluída

# MessageBox_ExportError
source: Export Error
pt_br: Erro na Exportação

# Message_ScrapingInProgress
source: Scraping is already in progress.
pt_br: A extração já está em andamento.

# Message_EnterUsername
source: Please enter a DeviantArt username.
pt_br: Por favor, insira um nome de usuário do DeviantArt.

# Message_EnterFilename
source: Please enter a filename.
pt_br: Por favor, insira um nome de arquivo.

# Message_ConfigureApi
source: Please configure your API credentials in Settings first.
pt_br: Por favor, configure suas credenciais de API nas Configurações primeiro.

# Message_NoGalleryItems
source: No gallery items found for user '{0}'.
pt_br: Nenhum item de galeria encontrado para o usuário '{0}'.

# Message_NoFavorites
source: No favorites found for user '{0}'.
pt_br: Nenhum favorito encontrado para o usuário '{0}'.

# Message_ScrapingError
source: Error during scraping: {0}
pt_br: Erro durante a extração: {0}

# Message_SuccessScraped
source: Successfully scraped {0} items and exported to {1}
pt_br: Extraídos com sucesso {0} itens e exportados para {1}

# Message_SuccessScrapedHtml
source: Successfully scraped {0} items and exported to {1} HTML page(s)
pt_br: Extraídos com sucesso {0} itens e exportados para {1} página(s) HTML

# Message_SuccessScrapedFavoritesHtml
source: Successfully scraped {0} favorites and exported to {1} HTML page(s)
pt_br: Extraídos com sucesso {0} favoritos e exportados para {1} página(s) HTML

# Message_SuccessScrapedFavorites
source: Successfully scraped {0} favorites and exported to {1}
pt_br: Extraídos com sucesso {0} favoritos e exportados para {1}

# Message_CancelledPartial
source: Scraping was cancelled after collecting {0} items. Would you like to export the partial results?
pt_br: A extração foi cancelada após coletar {0} itens. Deseja exportar os resultados parciais?

# Message_CancelledPartialFavorites
source: Scraping was cancelled after collecting {0} favorites. Would you like to export the partial results?
pt_br: A extração foi cancelada após coletar {0} favoritos. Deseja exportar os resultados parciais?

# Message_CancelledNoItems
source: Scraping was cancelled before any items were collected.
pt_br: A extração foi cancelada antes de coletar qualquer item.

# Message_CancelledNoFavorites
source: Scraping was cancelled before any favorites were collected.
pt_br: A extração foi cancelada antes de coletar qualquer favorito.

# Message_PartialExported
source: Successfully exported {0} items. {1}
pt_br: Exportados com sucesso {0} itens. {1}

# Message_PartialExportedHtml
source: Partial results exported to HTML ({0} page(s))
pt_br: Resultados parciais exportados para HTML ({0} página(s))

# Message_PartialExportedFile
source: Partial results exported to {0}
pt_br: Resultados parciais exportados para {0}

# Message_PartialExportError
source: Error exporting partial results: {0}
pt_br: Erro ao exportar resultados parciais: {0}

# Settings_Title
source: API Configuration
pt_br: Configuração da API

# Settings_WindowTitle
source: Settings - DeviantArt Scrapper
pt_br: Configurações - DeviantArt Scrapper

# Settings_ApiSettings
source: API Settings
pt_br: Configurações da API

# Settings_ClientId
source: Client ID:
pt_br: ID do Cliente:

# Settings_ClientSecret
source: Client Secret:
pt_br: Senha do Cliente:

# Settings_AuthStatus
source: Authentication Status
pt_br: Status de Autenticação

# Settings_TokenStatus
source: Token Status:
pt_br: Status do Token:

# Settings_NoToken
source: No token available
pt_br: Nenhum token disponível

# Settings_TokenValid
source: Valid until {0}
pt_br: Válido até {0}

# Settings_ConnectionSuccess
source: Connection successful!
pt_br: Conexão bem-sucedida!

# Settings_ConnectionFailed
source: Connection test failed: {0}
pt_br: Teste de conexão falhou: {0}

# Settings_SavedSuccess
source: Settings saved successfully!
pt_br: Configurações salvas com sucesso!

# Settings_SaveFailed
source: Failed to save settings: {0}
pt_br: Falha ao salvar configurações: {0}

# Settings_LoadFailed
source: Failed to load configuration: {0}
pt_br: Falha ao carregar configuração: {0}

# Settings_EnterCredentials
source: Please enter both Client ID and Client Secret.
pt_br: Por favor, insira o ID do Cliente e a Senha do Cliente.

# Filter_Csv
source: CSV files (*.csv)|*.csv
pt_br: Arquivos CSV (*.csv)|*.csv

# Filter_Html
source: HTML files (*.html)|*.html
pt_br: Arquivos HTML (*.html)|*.html

# Filter_Xlsx
source: Excel files (*.xlsx)|*.xlsx
pt_br: Arquivos Excel (*.xlsx)|*.xlsx

# Filter_All
source: All files (*.*)|*.*
pt_br: Todos os arquivos (*.*)|*.*
